{
    "title": "What’s Behind the Bitcoin Price Surge? Vibes, Mostly",
    "url": "https://www.wired.com/story/bitcoin-price-record-economics/",
    "publishedAt": "2024-03-12T18:13:56Z",
    "content": "To revisit this article, visit My Profile, then View saved stories.\nBy Joel Khalili\nBitcoin fever has returned. On March 5, the price of the cryptocurrency swelled to a record high—and has continued its upward march. In 2024 it has provided investors with a greater return than almost any other asset. But as enthusiasm for bitcoin spreads anew, so do myths and confusion around the forces moving the price.\nIn the last month alone, the price of bitcoin has risen by almost 70 percent. The surge has been celebrated in crypto circles as an inevitable return to form—the fun part of a predictable boom-and-bust cycle.\nThe phrases “number go up” and “it’s just math” have long been adopted as tongue-in-cheek mantras by crypto believers and ironic insults by its skeptics. Yet they capture a belief among hardliners that the economic architecture of the Bitcoin system—whereby a fixed supply of 21 million coins and predetermined schedule of release is hardcoded into the software—will inevitably propel the price upwards over time. They see scarcity as an antidote to runaway inflation of traditional currencies, which deteriorate in value, and unsustainable levels of debt taken on by governments across the globe.\nBitcoin is currently trading at over $72,000 per coin; proponents like Samson Mow, CEO of bitcoin-centric technology firm JAN3, have said they expect that value to reach as high as $1 million in the immediate future. “Money is fundamentally broken,” he told WIRED in November.\nThe jubilation and told-you-sos, however, drown out difficult questions around what it means to place a price on cryptocurrency. The proposition is deceptively tricky, says James Angel, an economist at Georgetown University specializing in financial markets, because bitcoin defies conventional valuation methods. There is no company behind Bitcoin whose performance can be analyzed. It does not generate revenue. It is not widely used to make payments or for any secondary purpose. It is not issued by any government. It resists easy comparisons. But one thing is certain, says Angel: “A limited supply does not equate to infinite value.”\nBitcoin emerged in 2008, in the wake of a global financial crisis. It was born of a frustration with the stewards of the world economy and the behavior of large banks and financial institutions, whose reckless financial engineering set the stage for the meltdown.\nThe new form of “electronic cash” was designed in such a way as to take control over monetary policy—the way money enters and is removed from circulation—away from central banks, imposing hard limits on supply and the schedule by which new coins were released.\n“The root problem with conventional currency is all the trust that's required to make it work,” wrote Satoshi Nakamoto, the elusive creator of Bitcoin, in a 2009 forum post. “The central bank must be trusted not to debase the currency, but the history of fiat currencies is full of breaches of that trust.” If bitcoin could gain a foothold as a globally recognized money, Satoshi and their early collaborators hoped, nobody’s savings could be devalued by the policy of any bank or government.\nDavid Kushner\nAndy Greenberg\nAndy Greenberg\nLouise Matsakis\nThe emergence of bitcoin has given way to a body of academic literature dedicated to the slippery problem of assigning a value to this new type of asset. The issue, says Silvia Dal Bianco, an economist at University College London, is that bitcoin defies easy definition. An analysis of the value of bitcoin, she says, to some extent “depends on what we think bitcoin is.”\nTo date, bitcoin has not been adopted widely as a way to purchase goods and services. Therefore, bitcoiners who believe its price will rise tend to emphasize its potential as a digital equivalent of gold—a commodity whose limited supply allows owners to hedge against inflation and general economic calamity.\nThat argument may have some merit on its own. But social media hype often flattens the nuances of bitcoin’s deflationary properties to something approximating: “The limited supply of bitcoin will drive up the price.” That’s where the “number go up” philosophy stems from.\nBut the fixed supply of bitcoin, says Angel, was priced in long ago. “In a well-functioning market, anything everybody already knows should already be incorporated into the price today.”\nA prominent misconception about bitcoin’s supply dynamics is that a process called the halving—whereby the amount of new bitcoin released into circulation is cut in half roughly every four years—is guaranteed to push the price upwards. The next halving is due to take place next month, prompting speculation about yet another rise in price. But the fact that each previous halving has been followed by an upswing has more to do with self-fulfilling speculation, says Angel, than any economic mechanism of the Bitcoin system.\nThe closest thing bitcoin has to fundamentals—characteristics that can be used to reach a solid valuation—is the cost of producing new coins, says Dal Bianco. In the same way the price of gold is linked to a degree to the cost of clawing ore from the ground, the price of bitcoin should at least loosely mirror the hardware and energy costs associated with mining new bitcoin. Yet the design of the system means bitcoin resists this method for valuation too. To ensure new supply is released at a steady rate, producing bitcoin becomes more computationally intensive—and therefore more expensive—as the level of competition among miners increases, and vice versa. If the price of bitcoin rises, more miners are drawn to participate, increasing the cost for all. Therefore, as Satoshi wrote in a 2010 forum post, the price of bitcoin “dictates the cost of production more than the other way around.”\nDetached from measurable fundamentals and real-world utility, fluctuations in the price of bitcoin reflect not much more than a collective belief that the price will either rise or fall. “It’s about what people think about bitcoin—it’s about animal spirits,” says Dal Bianco. That mentality isn’t limited to cryptocurrency; in 2021, investors whipped up a frenzy around so-called meme stocks, sending the prices skyward. Buyers were no longer betting on the prospects of the underlying businesses, only on further increases in price.\nDavid Kushner\nAndy Greenberg\nAndy Greenberg\nLouise Matsakis\nThe latest surge in the price of bitcoin is increasing the clamor around it, says Dal Bianco, drawing in yet more speculators and creating a “self-reinforcing cycle.” Likewise, when collective confidence in the prospect of further price growth falters, she says, the resultant downturn can be equally sudden. Under these conditions, demand can vanish as rapidly as it forms.\nOn March 3, Michael Green, chief strategist at asset management firm Simplify, entered into a wager with Peter McCormack, host of the podcast What Bitcoin Did. They were betting on the price of bitcoin. Green wagered $20,000 that bitcoin would not reach a price of $100,000 per coin by the end of the year. McCormack wagered $100,000 that it would.\nThe bet, Green says, was in part motivated by a desire to highlight areas of weakness in the economic theory presented as dogma by bitcoin evangelists. He takes issue with the way bitcoin is being sold to the investing public as “a store of value designed ultimately to be the currency of the future,” he says. “I think that is a bunch of economic nonsense.” Because the supply of bitcoin will shrink steadily over time as people lose access to irrecoverable wallets, Green argues, it cannot support a system of credit, because the cost of borrowing will eventually rise to a point that almost no one can afford.\nIn January, US regulators approved the first batch of bitcoin exchange-traded funds, which give people a way to invest in the cryptocurrency through a brokerage, as they would a regular stock. The arrival of bitcoin ETFs is said to have catalyzed the latest surge in price, by unlocking a wave of pent-up demand among investors—both institutions and regular people—previously unable or unwilling to deal with a crypto exchange or risk storing crypto manually themselves. In approving the new bitcoin funds, says Green, regulators have incentivized financial institutions for whom the ETFs represent a new source of revenue to “spend tons of money on marketing to drive demand,” and in turn disincentivized any emphasis on deficiencies in the logic of bitcoinomics.\nThe belief in the future potential of bitcoin has become religious, says Green. That missionary zeal is more likely to influence the price, says Green, than any economic mechanism built into the system. Even if McCormack were to lose the wager, he says, it could be chalked up as a fruitful marketing expense. McCormack told WIRED the wager with Green was not a marketing stunt. “I did the bet to prove him wrong,” he says.\nThe influence of evangelism on the price of bitcoin limits the opportunity for good-faith debate about the prospects of the Bitcoin system, says Angel.“Once you drink the Kool-Aid, you have a powerful financial incentive to preach to the world that bitcoin is the most wonderful thing,” he says. “If there were a Nobel prize in marketing, it should be given to Satoshi Nakamoto.”\nBitcoin’s biggest boosters embrace that dynamic as well. “Bitcoin price appreciation is an advertisement,” says Mow. Investors buy in on the prospect of riches—and then fall down the “rabbit hole” themselves, creating a new generation of believers to spread the Bitcoin gospel.\nIn your inbox: Will Knight's Fast Forward explores advances in AI\nHackers found a way to open 3 million hotel keycard locks\nA couple decided to decarbonize their home. Here's what happened\nA deepfake nude generator reveals a chilling look at its victims\nAre you noise sensitive? Here's how to turn the volume down a little\nJoel Khalili\nJoel Khalili\nAndy Greenberg\nCaroline Haskins\nJenna Scatena\nJoel Khalili\nLouise Matsakis\nAli Winston\nMore From WIRED\nReviews and Guides\n© 2024 Condé Nast. All rights reserved. WIRED may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices"
}