{
    "title": "Bitcoin Fog operator convicted of laundering $400M in bitcoins on darknet",
    "url": "https://arstechnica.com/tech-policy/2024/03/bitcoin-fog-operator-convicted-of-laundering-400m-in-bitcoins-on-darknet/",
    "publishedAt": "2024-03-13T20:34:08Z",
    "content": "Front page layout\nSite theme\nAshley Belanger\n    -    Mar 13, 2024 8:34 pm UTC\nA US federal jury has convicted a dual Russian-Swedish national, Roman Sterlingov, for operating Bitcoin Fog, \"the longest-running bitcoin money laundering service on the darknet,\" the Department of Justice announced yesterday.\nSterlingov ran Bitcoin Fog from 2011 to 2021, moving over 1.2 million bitcoin (approximately $400 million) before he was arrested, the DOJ said. In the press release, Deputy Attorney General Lisa Monaco said that the DOJ was \"relentless\" in efforts to \"painstakingly\" trace bitcoin \"through the blockchain to hold Sterlingov and his Bitcoin Fog enterprise to account.\"\n“Roman Sterlingov thought he could use the shadows of the Internet to launder hundreds of millions of dollars in bitcoin without getting caught,\" Monaco said. \"But he was wrong.”\nSterlingov faces a maximum penalty of 20 years in prison each for counts of money laundering conspiracy and sting money laundering. He was also convicted of \"operating an unlicensed money transmitting business and money transmission without a license in the District of Columbia, which each carry a maximum penalty of five years in prison,\" the DOJ said. Sentencing is scheduled for July.\nThroughout the trial, Sterlingov maintained his innocence, accusing the US of relying on \"junk science\" to trace bitcoin using faulty blockchain analysis techniques, Wired reported.\n\"I did not create Bitcoin Fog,\" Sterlingov told Wired in an interview from a Northern Virginia jail, likening his trial to \"a Kafkaesque nightmare.\"\nBut the DOJ \"produced more than three terabytes of data related to the case,\" Wired reported, showing \"a trail of financial transactions from 2011 allegedly linking Sterlingov to payments made to register the Bitcoinfog.com domain.\" From there, investigators used blockchain analysis to trace bitcoin payments that appeared to be Bitcoin Fog \"test transations\" ahead of the money laundering service's launch.\nSterlingov told Wired that he was simply a Bitcoin Fog user but never served as the service's operator and never used bitcoins for illegal activity.\nUltimately, \"court documents and evidence presented at trial\" proved that Sterlingov was Bitcoin Fog's operator, the DOJ said, helming \"the longest-running cryptocurrency 'mixer,'\" which gained \"notoriety as a go-to money laundering service for criminals seeking to hide their illicit proceeds from law enforcement.\" Investigators found that the bulk of cryptocurrency mixed through Bitcoin Fog\" came from darknet marketplaces and was tied to illegal narcotics, computer crimes, identity theft, and child sexual abuse material.\"\nBitcoin Fog launders money by charging a fee to mix bitcoins in a pool, redistributing the bitcoins in a way that supposedly makes it harder to trace and link bitcoins to the original source or associate bitcoins with illegal activity, Bleeping Computer explained.\nIn the DOJ's announcement, Acting Assistant Attorney General Nicole M. Argentieri said that Sterlingov and his customers \"believed they could use Bitcoin Fog to conceal these illicit transactions,” but the jury's guilty verdict shows \"that belief was mistaken.\"\nSterlingov's attorney, Tor Ekeland, told Ars that Sterlingov is \"disappointed\" and will be appealing, questioning both the choice of venue—which Ekeland thinks might be unconstitutional because the US Constitution requires that all federal criminal trials occur in the district where the crime occurred—and the DOJ's tracing techniques.\n\"I think there's significant issues here just involved in the tracing and the sufficiency of the evidence,\" Ekeland told Ars.\nEkeland said that the government's 2011 traces found what they identified as the first deposit into Bitcoin Fog, but there were many different addresses involved with that, and \"the only reason\" why Sterlingov got named is because he was the only one using Know Your Customer identification verification back then. Government witnesses, Ekeland said, admitted that this was consistent with him either selling bitcoin or hanging out with Bitcoin Fog founders, but not evidence of operating the service.\n\"Where's the shred of evidence of him actually operating the site? Because that I still haven't seen,\" Ekeland said.\nJ.W. Verret, an associate professor at George Mason University’s law school who testified at the trial, was \"sitting at the counsel table\" when the verdict was read, Verret wrote for CoinTelegraph.\n\"It felt like I was punched in the stomach,\" Verret wrote. \"The only way my brain can process it is to focus on strategies for appeal.\"\nVerret had testified on how investigators' techniques linking Sterlingov to Bitcoin Fog were flawed, briefly summarizing his views for CoinTelegraph before concluding that Sterlingov was \"an easy mark to pin the operation of Fog onto.\"\nIf techniques are flawed, that could complicate investigations happening globally. Bleeping Computer noted that worldwide, law enforcement is increasingly cracking down on cryptocurrency mixers, including Tornado Cash, ChipMixer, and Blender.io. Because of the links to criminal activity, law enforcement also has seemingly been collaborating more internationally. To arrest and convict Sterlingov, US law enforcement coordinated with Europol and Swedish and Romanian police.\nIn the DOJ's press release, the IRS' Criminal Investigation chief, Jim Lee, said that the IRS' \"special agents are specially equipped to follow the complex financial trail left by criminals, and we are dedicated to holding those accountable for crimes committed.” And US Attorney for the District of Columbia, Matthew Graves, issued a warning for anyone attempting to launder cryptocurrencies through mixers like Bitcoin Fog.\n“Darknet criminals should know by now that operations like Bitcoin Fog cannot provide the anonymity for cryptocurrency transactions that they claim they can,” Graves said.\nJoin the Ars Orbital Transmission mailing list to get weekly updates delivered to your inbox. Sign me up →\nCNMN Collection\n  WIRED Media Group\n  © 2024 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 1/1/20) and Privacy Policy and Cookie Statement (updated 1/1/20) and Ars Technica Addendum (effective 8/21/2018). Ars may earn compensation on sales from links on this site. Read our affiliate link policy.\nYour California Privacy Rights |  Do Not Sell My Personal Information\n  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.\nAd Choices"
}