{
    "title": "El Salvador gained $84M from Bitcoin holdings",
    "url": "https://readwrite.com/el-salvador-gained-84m-from-bitcoin-holdings/",
    "publishedAt": "2024-03-12T13:23:25Z",
    "content": "Radek Zielinski is an experienced technology and financial journalist with a passion for cybersecurity and futurology.\nSam Shedden is an experienced journalist and editor with over a decade of experience in online news. A seasoned technology writer and content strategist, he…\nEl Salvador's Bitcoin holdings have generated an $84 million unrealized profit. El Salvador became the first country to adopt Bitcoin as legal tender alongside the U.S. dollar in 2021. El Salvador offers a \"Freedom VISA\" program granting residency to individuals investing a minimum of $1 million in Bitcoin or USDT stablecoins.\nEl Salvador’s Bitcoin (BTC) holdings have yielded an unrealized profit of $84 million, with the treasury’s value increasing by 69% to over $206 million due to Bitcoin’s 250% appreciation over the past year.\nAccording to data gathered from NayibTracker, since September 2021, El Salvador has seen its Bitcoin investments swell to an unrealized profit of $84 million. The value of its Bitcoin treasury has soared to more than $206 million.\nThis marks a 69% increase from El Salvador’s initial investment, thanks to the cryptocurrency’s 250% appreciation over the past year. El Salvador now possesses 2,681 BTC, bought across 12 transactions at an average price of $42,600 each.\nEl Salvador became the first country to adopt Bitcoin as legal tender alongside the U.S. dollar in 2021, following the enactment of the “Bitcoin Law.” This legislation allows for the use of Bitcoin in transactions for goods, services, and taxes within the country. The country is also working to launch its “Volcano Bonds” backed by Bitcoin.\nPresident Nayib Bukele has shared that El Salvador is generating additional Bitcoin revenue through various services. These revenue streams include a citizenship passport program, converting Bitcoin to U.S. dollars for local businesses, proceeds from Bitcoin mining operations and government service fees.\n+ #BTC revenue from our passport program+ Revenue from converting #BTC to USD for local businesses+ #BTC from mining + #BTC revenue from government services https://t.co/O1sjKoJRiq\n— Nayib Bukele (@nayibbukele) March 11, 2024\n\nEl Salvador also launched the “Freedom VISA” program in December. The program offers residency to up to 1,000 individuals yearly who invest a minimum of $1 million in Bitcoin or Tether (USDT) stablecoins.\nThose who qualify are granted long-term residency permits and can eventually apply for full citizenship. Application to the program also costs a non-refundable fee of $999 in either Bitcoin or USDT. Tether announced that the firm will be managing the technical aspects of the project, by providing technology and payment infrastructure.\nThe ReadWrite Editorial policy involves closely monitoring the tech industry for major developments, new product launches, AI breakthroughs, video game releases and other newsworthy events. Editors assign relevant stories to staff writers or freelance contributors with expertise in each particular topic area. Before publication, articles go through a rigorous round of editing for accuracy, clarity, and to ensure adherence to ReadWrite's style guidelines.\nRadek Zielinski is an experienced technology and financial journalist with a passion for cybersecurity and futurology.\nThe use of AI image generators is becoming more and more prevalent as workers and creatives alike seek for more inspiration and a streamlined way of generating high-quality content for...\n\n\nBy signing up, you agree to our Terms and Privacy Policy. Unsubscribe anytime.\nExplore the latest in tech with our Tech News. We cut through the noise for concise, relevant updates, keeping you informed about the rapidly evolving tech landscape with curated content that separates signal from noise.\nExplore tech impact in In-Depth Stories. Narrative data journalism offers comprehensive analyses, revealing stories behind data. Understand industry trends for a deeper perspective on tech's intricate relationships with society.\nEmpower decisions with Expert Reviews, merging industry expertise and insightful analysis. Delve into tech intricacies, get the best deals, and stay ahead with our trustworthy guide to navigating the ever-changing tech market.\nREGULATION & HIGH RISK INVESTMENT WARNING: Trading Forex, CFDs and Cryptocurrencies is highly speculative, carries a level of risk and may not be suitable for all investors. You may lose some or all of your invested capital, therefore you should not speculate with capital that you cannot afford to lose. The content on this site should not be considered investment advice. Investing is speculative. When investing your capital is at risk. Please note that we do receive advertising fees for directing users to open an account with the brokers/advertisers and/or for driving traffic to the advertiser website\n© ReadWrite. All Rights Reserved."
}