{
    "title": "Nasdaq’s Bitcoin ETFs break five-day outflow streak with $15.4M boost",
    "url": "https://readwrite.com/nasdaqs-bitcoin-etfs-break-five-day-outflow-streak-with-15-4m-boost/",
    "publishedAt": "2024-03-26T14:20:47Z",
    "content": "Radek Zielinski is an experienced technology and financial journalist with a passion for cybersecurity and futurology.\nSam Shedden is an experienced journalist and editor with over a decade of experience in online news. A seasoned technology writer and content strategist, he…\nOn Monday, Nasdaq-traded spot Bitcoin (BTC) exchange-traded funds (ETFs) witnessed an inflow of $15.4 million, marking a positive shift after five consecutive days of outflows, according to preliminary figures from investment company Farside.\nThe inflow was predominantly led by Fidelity’s FBTC, which garnered $261.8 million, and was closely followed by BlackRock’s IBIT with a $35.5 million collection. Other ETFs such as BITB, BTCO, EZBC, and BRRR also saw inflows ranging from $11 million to $20 million. Contrarily, Grayscale’s ETF (GBTC) experienced a substantial outflow, losing over $350 million.\nThe previous week was challenging for these ETFs, with a total outflow of $887.6 million, primarily due to significant withdrawals from GBTC.\nThe launch of nearly a dozen spot ETFs in the U.S. on January 11 offered investors an opportunity to invest in Bitcoin without the complexities of direct ownership and storage. These funds directly invest in Bitcoin and avoid the necessity for position rollovers, distinguishing them from futures-based ETFs introduced in October 2021.\nThe newfound accessibility to Bitcoin can also potentially boost Bitcoin’s legitimacy and attract a broader investor base, potentially enhancing market liquidity and stability. Furthermore, it simplifies investing in Bitcoin through familiar stock exchange platforms and regulated environments, mitigating some security concerns and allowing tightly regulated institutions to partake in the market.\nSince the trading of spot ETFs commenced, the value of Bitcoin has surged by more than 50% to $70,750. On Monday, the price of Bitcoin experienced a more than 4% increase, momentarily exceeding $71,000.\nThe development follows the recently approved U.S. spot Bitcoin ETFs experiencing a day of record-breaking inflows exceeding $1 billion on Mar. 12.\nFeatured image: Ideogram\nThe ReadWrite Editorial policy involves closely monitoring the tech industry for major developments, new product launches, AI breakthroughs, video game releases and other newsworthy events. Editors assign relevant stories to staff writers or freelance contributors with expertise in each particular topic area. Before publication, articles go through a rigorous round of editing for accuracy, clarity, and to ensure adherence to ReadWrite's style guidelines.\nRadek Zielinski is an experienced technology and financial journalist with a passion for cybersecurity and futurology.\nThe use of AI image generators is becoming more and more prevalent as workers and creatives alike seek for more inspiration and a streamlined way of generating high-quality content for...\n\n\nBy signing up, you agree to our Terms and Privacy Policy. Unsubscribe anytime.\nExplore the latest in tech with our Tech News. We cut through the noise for concise, relevant updates, keeping you informed about the rapidly evolving tech landscape with curated content that separates signal from noise.\nExplore tech impact in In-Depth Stories. Narrative data journalism offers comprehensive analyses, revealing stories behind data. Understand industry trends for a deeper perspective on tech's intricate relationships with society.\nEmpower decisions with Expert Reviews, merging industry expertise and insightful analysis. Delve into tech intricacies, get the best deals, and stay ahead with our trustworthy guide to navigating the ever-changing tech market.\nREGULATION & HIGH RISK INVESTMENT WARNING: Trading Forex, CFDs and Cryptocurrencies is highly speculative, carries a level of risk and may not be suitable for all investors. You may lose some or all of your invested capital, therefore you should not speculate with capital that you cannot afford to lose. The content on this site should not be considered investment advice. Investing is speculative. When investing your capital is at risk. Please note that we do receive advertising fees for directing users to open an account with the brokers/advertisers and/or for driving traffic to the advertiser website\n© ReadWrite. All Rights Reserved."
}