{
    "title": "The Feds Are Reportedly Investigating Ethereum Foundation",
    "url": "https://gizmodo.com/sec-ethereum-price-bitcoin-investigation-crypto-etf-1851352576",
    "publishedAt": "2024-03-20T18:15:00Z",
    "content": "The U.S. Securities and Exchange Commission (SEC) is investigating the Ethereum Foundation and companies doing business with the nonprofit, according to a new report from Fortune Wednesday. And that’s very bad news for crypto enthusiasts who were hopeful that spot Ether ETFs, which would make it easier for investors to invest in the cryptocurrency without holding it personally, would be approved by regulators soon.\nThe news comes after CoinDesk first noticed on Wednesday that the Ethereum Foundation had recently included a note on Github about being investigated by an unnamed “state authority.” The spokesperson for the SEC told Gizmodo via email on Wednesday that, “The SEC does not comment on the existence or nonexistence of a possible investigation.”\nThe purpose of the SEC’s apparent investigation, according to people who spoke with Fortune, is to classify Ethereum as a security. The head of the SEC, Gary Gensler, has previously said Bitcoin isn’t a security but should be classified as a commodity while suggesting practically all other crypto coins are securities.\nFrom Fortune:\nAccording to a person at a company who received a recent subpoena  request, the SEC’s probe of the Swiss-based Ethereum Foundation began  shortly after the blockchain’s shift to a new governance model known as “proof-of-stake” in September of 2022.\nThat proof-of-stake event moved the blockchain away from the  energy-intensive model used by Bitcoin in favor of one that relies on a  trusted network of validators—and provided the SEC with a new pretext to  attempt to define Ethereum as a security, according to people at three  different companies familiar with the subpoenas. The people asked Fortune  not identify to identify them or their firms for fear of retaliation by  the agency’s chair, Gary Gensler, who one described as “vindictive.”\nWhy does it matter if Ethereum is a security? That means Ethereum and the exchanges that trade it will be subject to tighter enforcement from the SEC.\nEthereum’s price has ticked down roughly 14% over the past five days though it’s still up 98% in the past six months. The crypto coin was trading at roughly $1,600 in late September.\nEthereum was created in 2015 by programmer Vitalik Buterin after he rather famously became frustrated that his favorite World of Warcraft character’s capabilities were degraded. To Buterin, that was when he “realized what horrors centralized services can bring,” leading him to create an ostensibly decentralized crypto coin.\nButerin is estimated to be worth about $400 million, according to Forbes, down from about $1.4 billion in 2021."
}