{
    "title": "Why did the Bitcoin price drop?",
    "url": "https://readwrite.com/why-did-bitcoin-drop/",
    "publishedAt": "2024-03-15T12:38:50Z",
    "content": "Ali Rees is a freelance writer based in the UK. They have worked as a data and analytics consultant, a software tester, and a digital…\nSam Shedden is an experienced journalist and editor with over a decade of experience in online news. A seasoned technology writer and content strategist, he…\nBitcoin fell 9% to $66,885 after reaching $74,000. Traders may be selling Bitcoin to capitalize on 175% growth. Bitcoin's volatility linked to Federal Reserve's stance.\nDespite reaching record highs of almost $74,000 on Thursday (March 14), the price of Bitcoin (BTC) dropped by 9% early on Friday (March 15) to $66, 885.\nMany cryptocurrency traders will likely sell some of their Bitcoin holdings to cash in on the substantial 175% price increase over the past year. This profit-taking will be a contributing factor to the Bitcoin drop.\nCity Index analyst Matt Simpson told Sky News: “Bitcoin has an established history of getting volatile and ruthless after hitting a record high. And not only did it recently hit a new high, but it looks like the Federal Reserve won’t be as dovish as traders had hoped.”\nAnalysts speaking to Coindesk echoed this sentiment. “The recent surge in bitcoin prices has been too fast for the market to price correctly, so the current correction is expected,” Greta Yuan, Head of Research at VDX, a Hong Kong-licensed exchange said.\nA further complicating factor is the upcoming Bitcoin “halving”, which happens every four years and is due in April. During the halving, the number of new Bitcoins being made available will be permanently halved. After this point, just 450 BTC a day will enter the market.\nWhy is this significant? First and foremost it helps maintain and control Bitcoin’s fixed supply and the digital asset’s inflation rate over time. This escalating scarcity is part of why Bitcoin is valuable, however, there’s no evidence previous Halvings have caused the price to rise, which adds to the current uncertainty.\nOn top of this, the United States recently approved spot Bitcoin exchange-traded funds (ETF), which have seen huge volumes of capital passing through since their launch. The largest Bitcoin ETF is run by BlackRock with $15.5 billion flowing into the fund in the two months since its launch.\n“The historical trading volume of Blackrock’s Bitcoin ETF has caused some unease in the market,” said Adrian Wang, founder and CEO of Metalpha in an interview with Coindesk, “with some stakeholders fearing that Bitcoin’s price will surge too much too soon and could experience a flash crash,” Wang said.\nThe SEC has also delayed an important regulatory decision on whether to approve the trading of options on ETFs that invest directly in Bitcoin.\nThe market is uncertain and Bitcoin is historically volatile. Dips such as the one seen during Friday’s Asia trading hours are to be expected, especially amidst the anticipation of the halving.\nFeatured image credit: Generated with Ideagram\nThe ReadWrite Editorial policy involves closely monitoring the tech industry for major developments, new product launches, AI breakthroughs, video game releases and other newsworthy events. Editors assign relevant stories to staff writers or freelance contributors with expertise in each particular topic area. Before publication, articles go through a rigorous round of editing for accuracy, clarity, and to ensure adherence to ReadWrite's style guidelines.\nAli Rees is a freelance writer based in the UK. They have worked as a data and analytics consultant, a software tester, and a digital marketing and SEO specialist. They have been a keen gamer and tech enthusiast since their childhood in are currently the Gaming and Tech editor at Brig Newspaper. They also have a Substack where they review short video games. During the pandemic, Ali turned their hand to live streaming and is a fan of Twitch. When not writing, Ali enjoys playing video and board games, live music, and reading. They have two cats and both of…\nThe use of AI image generators is becoming more and more prevalent as workers and creatives alike seek for more inspiration and a streamlined way of generating high-quality content for...\n\n\nBy signing up, you agree to our Terms and Privacy Policy. Unsubscribe anytime.\nExplore the latest in tech with our Tech News. We cut through the noise for concise, relevant updates, keeping you informed about the rapidly evolving tech landscape with curated content that separates signal from noise.\nExplore tech impact in In-Depth Stories. Narrative data journalism offers comprehensive analyses, revealing stories behind data. Understand industry trends for a deeper perspective on tech's intricate relationships with society.\nEmpower decisions with Expert Reviews, merging industry expertise and insightful analysis. Delve into tech intricacies, get the best deals, and stay ahead with our trustworthy guide to navigating the ever-changing tech market.\nREGULATION & HIGH RISK INVESTMENT WARNING: Trading Forex, CFDs and Cryptocurrencies is highly speculative, carries a level of risk and may not be suitable for all investors. You may lose some or all of your invested capital, therefore you should not speculate with capital that you cannot afford to lose. The content on this site should not be considered investment advice. Investing is speculative. When investing your capital is at risk. Please note that we do receive advertising fees for directing users to open an account with the brokers/advertisers and/or for driving traffic to the advertiser website\n© ReadWrite. All Rights Reserved."
}