{
    "title": "Woman found with £2bn in Bitcoin convicted",
    "url": "https://www.bbc.co.uk/news/uk-england-london-68620253",
    "publishedAt": "2024-03-20T17:50:49Z",
    "content": "A former takeaway worker found with Bitcoin worth more than Â£2bn has been convicted at Southwark Crown Court of a crime linked to money laundering.\nJian Wen, 42, from Hendon in north London, was involved in converting the currency into assets including multi-million-pound houses and jewellery.\nOn Monday she was convicted of entering into or becoming concerned in a money laundering arrangement.\nThe Met said the seizure is the largest of its kind in the UK.\nAlthough Wen was living in a flat above a Chinese restaurant in Leeds when she became involved in the criminal activity, her new lifestyle saw her move into a six-bedroom house in north London in 2017 which was rented for more than Â£17,000 per month.\nShe posed as an employee of an international jewellery business and moved her son to the UK to attend private school, the Crown Prosecution Service (CPS) said.\nThat same year, Wen tried to buy a string of expensive houses in London, but struggled to pass money-laundering checks and her claims she had earned millions legitimately mining Bitcoin were not believed.\nShe later travelled abroad, buying jewellery worth tens of thousands of pounds in Zurich, and purchasing properties in Dubai in 2019.\nAnother suspect is thought to be behind the fraud but they remain at large.\nThe Met said it carried out a large scale investigation as part of the case - searching several addresses, reviewing 48 electronic devices, and examining thousands of digital files including many which were translated from Mandarin.\nDet Ch Supt Jason Prins, whose team led the investigation, said the \"sheer scale\" of the operation \"demonstrates how international criminals seek to exploit cryptocurrency for illegal purposes\".\n\"This verdict and lengthy five-year investigation demonstrates that we'll leave no stone unturned in our pursuit to catch criminals who look to enjoy the proceeds of illicit funds - no matter how complex the case,\" he said.\nThe CPS has obtained a freezing order from the High Court, while it carries out a civil recovery investigation that could lead to the forfeiture of the Bitcoin.\nThe value of the Bitcoin was worth around Â£2bn at the time of initial estimates - but due to the fluctuation in the currency's value, it has since increased to around Â£3.4bn.\nCPS chief crown prosecutor Andrew Penhale said Bitcoin and other cryptocurrencies \"are increasingly being used by organised criminals to disguise and transfer assets, so that fraudsters may enjoy the benefits of their criminal conduct\".\nHe added this case \"illustrates the scale of criminal proceeds available to those fraudsters\".\nWen is due to be sentenced on 10 May.\nListen to the best of BBC Radio London on Sounds and follow BBC London on Facebook, X and Instagram. Send your story ideas to hellobbclondon@bbc.co.uk\nHM Courts & Tribunals Service\nTrailer released for crime boss film âBermondsey Tales: Fall of the Roman Empireâ\nMan arrested after woman in her 20s found dead in car in Hackney\nWhy a trip to Brighton should definitely be on your agenda this spring or summer\nWhy a trip to Brighton should definitely be on your agenda this spring or summer\nTwo passenger planes collide while on tarmac at Heathrow Airport\nHavering Council planning applications March 26 to April 1\nThousands of Israelis rally to demand hostage deal\nWest faces 'authoritarian' alliance, says Nato head\nRussia-friendly populist elected Slovak president\nThe eclipse's 4-minute window into the Sun's secrets\nIndigenous deaths in custody haunt Australia\nOne womanâs battle to push Africaâs space race\nYour pictures on the theme of 'my commute'\nDanish hippy commune fights back against drug gangs\nA tale of two earthquakes: How Taiwan learnt from past disaster\nSix months on, how close is Israel to eliminating Hamas?\nTracking the world's biggest iceberg as it drifts towards oblivion\nNew Yorkers mostly unshaken by rare earthquake\nIt's make or break time\nAnother set of eager entrepreneurs hope to impress the fearsome panel\nBruce Lee as you've never seen him before\nTen defining pictures throw a unique lens onto an extraordinary life\nAmbition, money and deception\nThe scandalous true story of Elizabeth Holmes and Theranos, starring Amanda Seyfried\nFrom Starman to film star...\nHow did the silver screen inspire David Bowie?\nÂ© 2024 BBC. The BBC is not responsible for the content of external sites. Read about our approach to external linking."
}