{
    "title": "World’s top pension fund eyes Bitcoin",
    "url": "https://readwrite.com/worlds-top-pension-fund-eyes-bitcoin/",
    "publishedAt": "2024-03-19T14:13:51Z",
    "content": "Radek Zielinski is an experienced technology and financial journalist with a passion for cybersecurity and futurology.\nSam Shedden is an experienced journalist and editor with over a decade of experience in online news. A seasoned technology writer and content strategist, he…\nGPIF, world's largest pension fund, mulls Bitcoin for diversification. Initiates 5-year research for innovative investment strategies. Request for information on potential diversification instruments.\nJapan’s Government Pension Investment Fund (GPIF) is considering Bitcoin (BTC) as a potential investment diversification tool amidst economic and technological changes.\nAccording to a Mar. 19 announcement, the Government Pension Investment Fund (GPIF) of Japan, recognized as the world’s biggest pension fund, is considering Bitcoin as a possible tool for diversification. The GPIF unveiled plans for new long-term investment strategies in light of significant societal and economic shifts, alongside rapid technological advancements.\nTo address these evolving challenges, the GPIF has initiated a five-year research initiative aimed at discovering innovative investment diversification methods. This initiative places a strong focus on sustainability and managing risks.\nPart of this initiative involves the GPIF seeking information on a range of potential diversification instruments, including assets it currently views as illiquid and does not possess. Among those assets there are cryptocurrencies such as Bitcoin, precious metals such as gold, and other types of assets.\nThis recent announcement from the GPIF serves as a request for information and does not confirm the fund’s future expansion into any of those assets. The decision to conduct further research will be based on the data gathered through this request.\nFounded in 2006 by the Japanese government, the GPIF’s investment strategy has traditionally focused on core infrastructure funds, which support essential social and economic activities. The fund diversifies its investments across traditional assets such as domestic and international stocks and bonds, in addition to alternative assets like infrastructure and real estate.\nThe report highlighted the fund’s goal to leverage its long-term investment horizon for achieving stable and efficient returns, despite short-term market price fluctuations. As of December 2023, GPIF managed assets totaling 225 trillion Japanese yen ($1.54 trillion), securing its position as the largest pension fund globally.\nAlthough GPIF is in the preliminary stages of exploring the inclusion of Bitcoin in its portfolio, some global pension funds have already made moves into Bitcoin-related assets. For instance, in November 2023, South Korea’s National Pension Service announced the acquisition of over 280,000 shares in the U.S.-based Coinbase.\nWith the approval of the United States Bitcoin spot exchange-traded funds (ETF) by the Securities and Exchange Commission back in January, the world’s first cryptocurrency has gained more credibility which may get major financial institutions on  board. Following the approval, the daily Bitcoin ETF inflows surpassed $1 billion earlier this month.\nFeatured image: Ideogram\nThe ReadWrite Editorial policy involves closely monitoring the tech industry for major developments, new product launches, AI breakthroughs, video game releases and other newsworthy events. Editors assign relevant stories to staff writers or freelance contributors with expertise in each particular topic area. Before publication, articles go through a rigorous round of editing for accuracy, clarity, and to ensure adherence to ReadWrite's style guidelines.\nRadek Zielinski is an experienced technology and financial journalist with a passion for cybersecurity and futurology.\nThe use of AI image generators is becoming more and more prevalent as workers and creatives alike seek for more inspiration and a streamlined way of generating high-quality content for...\n\n\nBy signing up, you agree to our Terms and Privacy Policy. Unsubscribe anytime.\nExplore the latest in tech with our Tech News. We cut through the noise for concise, relevant updates, keeping you informed about the rapidly evolving tech landscape with curated content that separates signal from noise.\nExplore tech impact in In-Depth Stories. Narrative data journalism offers comprehensive analyses, revealing stories behind data. Understand industry trends for a deeper perspective on tech's intricate relationships with society.\nEmpower decisions with Expert Reviews, merging industry expertise and insightful analysis. Delve into tech intricacies, get the best deals, and stay ahead with our trustworthy guide to navigating the ever-changing tech market.\nREGULATION & HIGH RISK INVESTMENT WARNING: Trading Forex, CFDs and Cryptocurrencies is highly speculative, carries a level of risk and may not be suitable for all investors. You may lose some or all of your invested capital, therefore you should not speculate with capital that you cannot afford to lose. The content on this site should not be considered investment advice. Investing is speculative. When investing your capital is at risk. Please note that we do receive advertising fees for directing users to open an account with the brokers/advertisers and/or for driving traffic to the advertiser website\n© ReadWrite. All Rights Reserved."
}